package ex02연산자;

public class ex04연산자정리 {

	public static void main(String[] args) {

		// 1. 대입 연산자
		// : 복합대입연산자!!!!! +=, -+, *=
		// ex) a += b = --> a = a + b
		// --> 동일한 변수명을 2번 작성하기 싫어서!
		
		// 2. 증감 연산자 
		// : 변수 안에 들어있는 데이터를 1씩 증가, 1씩 감소
		// ++, --
		// : 해당하는 기호가 변수를 기준으로 앞쪽에 붙어있는지,
		//   뒤쪽에 붙어있는지에 따라 연산결과가 달라진다.
		
		// 3. 대입 연산자
		// < , <= , > , >= , ==(같다), !=(다르다)
		// : 연산 결과값이 boolean(논리자료형)으로 나온다.
		
		// 4. 논리 연산자
		// !(NOT), %%(AND), ||(OR)
		// : 연산을 당하는 항이 boolean (논리자료형) 이어야한다.
		// : 연산 결과값이 boolean(논리자료형)으로 나온다.
		// ex) true && false --> false
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
	}

}
